# list of students
students = [
    'Абделфаттах Ахмед',
    'Абейдуллов Алмаз',
    'Аль-Гурайри Зайд',
    'Ахметгалеев Ислам',
    'Багаутдинов Артём',
    'Валиев Нияз',
    'Габдулхаков Разиль',
    'Гаврилов Николай',
    'Галимуллин Марсель',
    'Гатауллин Тимур',
    'Громов Даниил',
    'Елазаб Мохамед',
    'Йолдошева Умидабону',
    'Марцинко Александр',
    'Миндубаев Инсаф',
    'Мохамед Магед',
    'Муфтиев Ильяс',
    'Саниев Руслан',
    'Сафиуллин Ранис',
    'Тихонов Андрей',
    'Французов Денис',
    'Хамидуллин Булат',
    'Хузиев Ратмир',
    'Хузин Камиль',
    'Шагеева Лейла',
    'Шайдуллин Марсель',
    'Щеняев Ярослав'
]

# schedule for 1 subgroup
schedule_1 = {
    'even': {
        'monday': [
            {
                'start': '8:00',
                'end': '9:30',
                'subject': 'Базы данных'
            },
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'Введение в программную инженерию'
            }
        ],
        'tuesday': [],
        'wednesday': [
            {
                'start': '8:00',
                'end': '11:40',
                'subject': 'КИТПО'
            }
        ],
        'thursday': [
            {
                'start': '8:00',
                'end': '9:30',
                'subject': 'Низкоуровневое программирование'
            },
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'КИТПО'
            },
            {
                'start': '13:30',
                'end': '16:40',
                'subject': 'Операционные системы'
            }
        ],
        'friday': [
            {
                'start': '8:00',
                'end': '11:10',
                'subject': 'Хер знает там по датам'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Низкоуровненвое программирование'
            },
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'Низкоуровненвое программирование'
            }
        ],
        'saturday': [
            {
                'start': '8:00',
                'end': '9:30',
                'subject': 'Архитектура ЭВМ'
            },
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'Операционные системы'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Физра'
            }
        ],
        'sunday': []
    },
    'odd': {
        'monday': [
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'Базы данных'
            },
            {
                'start': '15:10',
                'end': '16:40',
                'subject': 'Операционные системы'
            },
            {
                'start': '16:50',
                'end': '18:20',
                'subject': 'ФиЛП'
            }
        ],
        'tuesday': [],
        'wednesday': [
            {
                'start': '8:00',
                'end': '11:40',
                'subject': 'Архитектура ЭВМ'
            }
        ],
        'thursday': [
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'КИТПО'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Базы данных'
            }
        ],
        'friday': [
            {
                'start': '8:00',
                'end': '11:10',
                'subject': 'Хер знает там по датам'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'ФиЛП'
            },
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'ФиЛП'
            }
        ],
        'saturday': [
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Физра'
            },
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'Архитектура ЭВМ'
            }
        ],
        'sunday': []
    }
}

# schedule for 2 subgroup
schedule_2 = {
    'even': {
        'monday': [
            {
                'start': '8:00',
                'end': '9:30',
                'subject': 'Базы данных'
            },
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'Введение в программную инженерию'
            }
        ],
        'tuesday': [],
        'wednesday': [
            {
                'start': '8:00',
                'end': '11:40',
                'subject': 'Архитектура ЭВМ'
            }
        ],
        'thursday': [
            {
                'start': '8:00',
                'end': '9:30',
                'subject': 'Низкоуровневое программирование'
            },
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'КИТПО'
            }
        ],
        'friday': [
            {
                'start': '8:00',
                'end': '11:10',
                'subject': 'Хер знает там по датам'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'ФиЛП'
            },
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'ФиЛП'
            }
        ],
        'saturday': [
            {
                'start': '8:00',
                'end': '9:30',
                'subject': 'Архитектура ЭВМ'
            },
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'Операционные системы'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Физра'
            }
        ],
        'sunday': []
    },
    'odd': {
        'monday': [
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'Базы данных'
            },
            {
                'start': '15:10',
                'end': '16:40',
                'subject': 'Операционные системы'
            },
            {
                'start': '16:50',
                'end': '18:20',
                'subject': 'ФиЛП'
            }
        ],
        'tuesday': [],
        'wednesday': [
            {
                'start': '15:16',
                'end': '16:00',
                'subject': 'КИТПО'
            }
        ],
        'thursday': [
            {
                'start': '9:40',
                'end': '11:10',
                'subject': 'КИТПО'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Базы данных'
            },
            {
                'start': '13:30',
                'end': '16:40',
                'subject': 'Операционные системы'
            }
        ],
        'friday': [
            {
                'start': '8:00',
                'end': '11:10',
                'subject': 'Хер знает там по датам'
            },
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Низкоуровневое программирование'
            },
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'Низкоуровневое программирование'
            }
        ],
        'saturday': [
            {
                'start': '11:20',
                'end': '12:50',
                'subject': 'Физра'
            },
            {
                'start': '13:30',
                'end': '15:00',
                'subject': 'Архитектура ЭВМ'
            }
        ],
        'sunday': []
    }
}
